"Job Log" = "Jobprotokoll";
"Job Log2" = "Jobprotokoll";

"User ID" = "Anwender-ID";
"User ID:" = "Anwender-ID:";

"Job Type" = "Jobtyp";
"Job Type:" = "Jobtyp:";

"File Name" = "Dateiname";
"File Name:" = "Dateiname:";

"Password" = "Passwort";
"Password:" = "Passwort:";

"User Code" = "Anwendercode";
"User Code:" = "Anwendercode:";

"Time" = "Zeit";
"Time:" = "Zeit:";

"Enable User Code" = "Anwendercode aktivieren";
"Pop up Every Time" = "Jedesmal einblenden";
"User Code Always Blank" = "Anwendercode immer leer";
"OK" = "OK";
"Cancel" = "Abbrechen";
"Enable Specify Time" = "Druckzeit einst.";

"Folder Number" = "Ordnernummer";
"Folder Number:" = "Ordnernummer:";

"Folder Password" = "Ordnerpasswort";
"Folder Password:" = "Ordnerpasswort:";

"Normal Print" = "Normaldruck";
"Sample Print" = "Probedruck";
"Locked Print" = "Vertraulicher Druck";
"Hold Print" = "Angehaltener Druck";
"Stored Print" = "Gespeicherter Druck";
"Store and Print" = "Speichern und Drucken";
"Document Server" = "Document Server";

"(4-8 digits)" = "(4-8 Stellen.)";

"Enter a valid File Name" = "Geben Sie einen gültigen Dateinamen ein.";
"Enter a valid Password" = "Geben Sie ein gültiges Passwort ein.";
"Enter a valid User Code" = "Geben Sie einen gültigen Anwendercode ein.";
"Enter a valid User ID" = "Geben Sie eine gültige Anwender-ID ein.";
"Enter a valid Folder Password" = "Geben Sie ein gültiges Ordnerpasswort ein.";

"(Up to 8 alphanumeric characters)" = "(Bis zu 8 alphanumerische Zeichen.)";
"(Up to 16 alphanumeric characters)" = "(Bis zu 16 alphanumerische Zeichen.)";
"(4 digits)" = "(4-8 Stellen.)";
"(Up to 8 digits)" = "(4-8 Stellen.)";